import 'dart:math';

class CalculatorBrain {
  CalculatorBrain({this.height, this.weight});

  final int height;
  final int weight;

  double _bmi;

  String calculateBMI() {
    _bmi = weight / pow(height / 100, 2);
    return _bmi.toStringAsFixed(1);
  }

  String getResult() {
    if (_bmi >= 30) {
      return 'อ้วนระดับ 3';
    } else if (_bmi > 24.9) {
      return 'อ้วนระดับ 2';
    } else if (_bmi > 22.9) {
      return 'อ้วนระดับ 1';
    } else if (_bmi > 18.50) {
      return 'น้ำหนักปกติ';
    } else {
      return 'น้ำหนักน้อย';
    }
  }

  String getInterpretation() {
    if (_bmi >= 30) {
      return 'เกณฑ์ปกติมีค่าระหว่าง 18.5 - 22.9\n\nควรควบคุมอาหารโดยลดปริมาณอาหาร ปรับทานอาหารที่ให้พลังงานน้อย ลดอาหารไขมัน อาหารทอด เนื้อสัตว์ เครื่องดื่มที่ใส่น้ำตาล แอลกอฮอล์ ขนมหวาน และออกกำลังกายพร้อมฝึกความแข็งแรงของกล้ามเนื้ออย่างสม่ำเสมอทุกวัน ประมาณ 40 - 60 นาทีต่อวัน';
    } else if (_bmi > 24.9) {
      return 'เกณฑ์ปกติมีค่าระหว่าง 18.5 - 22.9\n\nควรควบคุมอาหารโดยลดปริมาณอาหาร ปรับทานอาหารที่ให้พลังงานน้อย ลดอาหารไขมัน อาหารทอด เนื้อสัตว์ เครื่องดื่มที่ใส่น้ำตาล แอลกอฮอล์ ขนมหวาน และออกกำลังกายพร้อมฝึกความแข็งแรงของกล้ามเนื้ออย่างสม่ำเสมอทุกวัน ประมาณ 40 - 60 นาทีต่อวัน';
    } else if (_bmi > 22.9) {
      return 'เกณฑ์ปกติมีค่าระหว่าง 18.5 - 22.9\n\nควรควบคุมอาหาร ลดอาหารไขมัน อาหารทอด เนื้อสัตว์ เครื่องดื่มที่ใส่น้ำตาล แอลกอฮอล์ ขนมหวาน และออกกำลังกายอย่างสม่ำเสมอทุกวัน ประมาณ 30 นาทีต่อวัน';
    } else if (_bmi > 18.50) {
      return 'เกณฑ์ปกติมีค่าระหว่าง 18.5 - 22.9\n\nควรทานอาหารให้ครบ 5 หมู่ในปริมาณที่เหมาะสม และออกกำลังกายอย่างสม่ำเสมอ เพื่อสุขภาพที่ดีอย่างต่อเนื่อง';
    } else {
      return 'เกณฑ์ปกติมีค่าระหว่าง 18.5 - 22.9\n\nควรทานอาหารให้ครบ 5 หมู่ในปริมาณที่เหมาะสม โดยเพิ่มอาหารประเภทที่ให้พลังงานมากขึ้น เช่น ไขมัน เนื้อสัตว์ แป้ง ข้าว นม และออกกำลังกายอย่างสม่ำเสมอ';
    }
  }
}
